rainer20512/stm32-fw/common/src/dev/uart_dev.c
/**
  ******************************************************************************
  * @file    usart.c
  * @author  Rainer 
  * @brief   Initialize on of the STM32L4's U(S)ARTs as debug output, assign
  *          input and output buffers and start receive and transmit
  *
  * @note    Receive is done on a character by character basis by Interrupts
  *          Transmit is done blockwise by DMA
  *          The U(S)ARTs Receive line is also used as edge triggered EXTI
  *          interrupt to wakeup from Stop.
  * 
  ******************************************************************************
  *
  ******************************************************************************
  * @addtogroup USART
  * @{
  */
/* Includes ------------------------------------------------------------------*/

#include <string.h>

#include "config/config.h"
#include "error.h"
#include "dev/hw_device.h"
#include "system/hw_util.h"

#include "dev/uart_dev.h"
#include "dev/devices.h"
#include "config/uart_config.h"

#include "debug_helper.h"

/*******************************************************************************************
 * Additional data that will be stored to UART type hardware devices
 ******************************************************************************************/

typedef struct {
//    USART_TypeDef       *myUart;
    UsartHandleT        *myHandle;
    uint32_t            myBaudrate;
    uint32_t            myStopbits;
    uint32_t            myParity;
    uint32_t            myWordlength;
} USART_AdditionalDataType;

/* ------------------------------------------------------------------------------*/
/* Public device variables ------------------------------------------------------*/
/* ------------------------------------------------------------------------------*/
/* UART declarations */

typedef enum UsartDmaDirectionEnum {
  USART_DMA_RX=0,                       // Rx DMA
  USART_DMA_TX,                         // Tx DMA
} UsartDmaDirectionEnumType;

/* ------------------------------------------------------------------------------*/
/* Forward declarations ---------------------------------------------------------*/
/* ------------------------------------------------------------------------------*/
void UsartStopTx            (UsartHandleT *uhandle);
void UsartStopRx            (UsartHandleT *uhandle);

/* ------------------------------------------------------------------------------*/
/* Private functions ------------------------------------------------------------*/
/* ------------------------------------------------------------------------------*/

static USART_AdditionalDataType * USART_GetAdditionalData(const HW_DeviceType *self)
{
    #if DEBUG_MODE > 0
        if ( self->devType != HW_DEVICE_UART )
            DEBUG_PUTS("Passed device is not an u(s)art!");
    #endif
    assert(self->devType == HW_DEVICE_UART);
    return (USART_AdditionalDataType *)(self->devData);
}

UsartHandleT * USART_GetHandleFromDev(const HW_DeviceType *self)
{
    return USART_GetAdditionalData(self)->myHandle;
}


#define TX_IDX  0
#define RX_IDX  1
#if 0
#define USE_USART2
#define USE_USART3
#define USE_UART4
#define USE_UART5
#define USE_USART6
#define USE_UART7
#define USE_UART8
#endif

#if defined(STM32L476xx) || defined(STM32L496xx)
    static bool Usart_SetClockSource(const void *hw)
    {
      RCC_PeriphCLKInitTypeDef PeriphClkInit;

      PeriphClkInit.PeriphClockSelection = 0;
      switch ( (uint32_t)hw ) {
    #if defined(USART1) && defined(USE_USART1)
        case USART1_BASE:
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1; 
        PeriphClkInit.Usart1ClockSelection = USART1_CLKSOURCE;
        break;
    #endif
    #if defined(USART2) && defined(USE_USART2)
        case USART2_BASE:
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART2; 
        PeriphClkInit.Usart2ClockSelection = USART2_CLKSOURCE;
        break;
    #endif
    #if defined(USART3) && defined(USE_USART3)
        case USART3_BASE:    
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART3; 
        PeriphClkInit.Usart3ClockSelection = USART3_CLKSOURCE;
        break;
    #endif
    #if defined(UART4) && defined(USE_UART4)
        case UART4_BASE:
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_UART4; 
        PeriphClkInit.Uart4ClockSelection  = UART4_CLKSOURCE;
        break;
    #endif
    #if defined(UART5) && defined(USE_UART5)
        case UART5_BASE:
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_UART5; 
        PeriphClkInit.Uart5ClockSelection  = UART5_CLKSOURCE;
        break;
    #endif
    #if defined(LPUART1) && defined(USE_LPUART1)
        case LPUART1_BASE:
        PeriphClkInit.PeriphClockSelection  = RCC_PERIPHCLK_LPUART1; 
        PeriphClkInit.Lpuart1ClockSelection = LPUART1_CLKSOURCE;
        break;
    #endif
        default:
            DEBUG_PRINTF("No Clock source set receipe for HW base 0x%08x\n", (uint32_t)hw );
            return false;
      } // switch

      if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) {
        DEBUG_PRINTF("failed to set source for HW base 0x%08x\n", (uint32_t)hw );
        return false;
      }

      return true;
    }
#elif defined(STM32H747xx) || defined(STM32H745xx) || defined(STM32H742xx) || defined(STM32H743xx)
    static bool Usart_SetClockSource(const void *hw)
    {
      RCC_PeriphCLKInitTypeDef PeriphClkInit;

      PeriphClkInit.PeriphClockSelection = 0;
      switch ( (uint32_t)hw ) {
    #if defined(USART1) && defined(USE_USART1)
        case USART1_BASE:
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1; 
        PeriphClkInit.Usart16ClockSelection = USART16_CLKSOURCE;
        break;
    #endif
    #if defined(USART2) && defined(USE_USART2)
        case USART2_BASE:
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART2; 
        PeriphClkInit.Usart234578ClockSelection = USART234578_CLKSOURCE;
        break;
    #endif
    #if defined(USART3) && defined(USE_USART3)
        case USART3_BASE:    
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART3; 
        PeriphClkInit.Usart234578ClockSelection = USART234578_CLKSOURCE;
        break;
    #endif
    #if defined(UART4) && defined(USE_UART4)
        case UART4_BASE:
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_UART4; 
        PeriphClkInit.Usart234578ClockSelection = USART234578_CLKSOURCE;
        break;
    #endif
    #if defined(UART5) && defined(USE_UART5)
        case UART5_BASE:
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_UART5; 
        PeriphClkInit.Usart234578ClockSelection = USART234578_CLKSOURCE;
        break;
    #endif
    #if defined(USART6) && defined(USE_USART6)
        case USART6_BASE:
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART6; 
        PeriphClkInit.Usart16ClockSelection = USART16_CLKSOURCE;
        break;
    #endif
    #if defined(UART7) && defined(USE_UART7)
        case UART7_BASE:
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_UART7; 
        PeriphClkInit.Usart234578ClockSelection = USART234578_CLKSOURCE;
        break;
    #endif
    #if defined(UART8) && defined(USE_UART8)
        case UART8_BASE:
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_UART8; 
        PeriphClkInit.Usart234578ClockSelection = USART234578_CLKSOURCE;
        break;
    #endif
    #if defined(LPUART1) && defined(USE_LPUART1)
        case LPUART1_BASE:
        PeriphClkInit.PeriphClockSelection  = RCC_PERIPHCLK_LPUART1; 
        PeriphClkInit.Lpuart1ClockSelection = LPUART1_CLKSOURCE;
        break;
    #endif
        default:
            DEBUG_PRINTF("No Clock source set receipe for HW base 0x%08x\n", (uint32_t)hw );
            return false;
      } // switch

