rainer20512/stm32-fw/common/src/dev/uart_dev.c
      if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) {
        DEBUG_PRINTF("failed to set source for HW base 0x%08x\n", (uint32_t)hw );
        return false;
      }

      return true;
    }
#else 
    #error "No usart clock assignment defined"
#endif

/*
 * Init or DeInit Clock / clocksource 
 */
static bool Usart_Clock_Init(const HW_DeviceType *self, bool bDoInit)
{
    /* Select clock source on init*/
    if ( bDoInit ) {
        if ( !Usart_SetClockSource( self->devBase ) ) return false;
    }

    /* Enable/Disable clock */
    HW_SetHWClock( ( USART_TypeDef*)self->devBase, bDoInit );
    return true;
}

bool Usart_GPIO_Init(const HW_DeviceType *self)
{
    GPIO_InitTypeDef  GPIO_InitStruct;


    /*##-2- Configure Tx and Rx pins ##########################################*/  
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_LOW;

    uint32_t devIdx = GetDevIdx(self);
    GpioAFInitAll(devIdx, self->devGpioAF, &GPIO_InitStruct);

    return true;
}

/******************************************************************************
 * Se the U(S)ARTs communication parameters
 * currently all comm parameters except baudrate are fixed!
 *****************************************************************************/
bool Usart_SetCommParamsLong(const HW_DeviceType *self, UsartCommT *comm, bool bFirstInit )
{
  UsartHandleT *myHandle = USART_GetHandleFromDev(self);
  UART_HandleTypeDef huart={0};
  USART_TypeDef *utiny  = myHandle->Instance;
 
  /* keep actual baudrate in mind ( need it if system frequancy changes */
  myHandle->baudrate = comm->baudrate;

  /* Disable U(S)ART temporarily */
  utiny->CR1 &= ~USART_CR1_UE;

  /* Reset U(S)ARTs config on first init */
  if ( bFirstInit ) {
      utiny->CR1 = 0x0U;
      utiny->CR2 = 0x0U;
      utiny->CR3 = 0x0U;
  }

  huart.Instance            = utiny;
  huart.Init.BaudRate       = comm->baudrate;
  huart.Init.WordLength     = comm->wordlength;
  huart.Init.StopBits       = comm->stopbits;
  huart.Init.Parity         = comm->parity;
  huart.Init.HwFlowCtl      = UART_HWCONTROL_NONE;
  huart.Init.Mode           = UART_MODE_TX_RX;
  huart.Init.OverSampling   = UART_OVERSAMPLING_16;
  huart.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;

  /* Set the UART Communication parameters */
  if (UART_SetConfig(&huart) == HAL_ERROR) {
      Error_Handler_XX(-15, __FILE__, __LINE__);
      return false;
  }

  /* Set Wakeup Flag selection to RXNE */
  utiny->CR3 |= (USART_CR3_WUS_0 | USART_CR3_WUS_1);

  /* If RX mode is not character mode, disable Receiver, must be enabled manually */
  if (!myHandle->bRxCharMode) CLEAR_BIT(utiny->CR1, USART_CR1_RE);

  /* Enable U(S)ART  */
  utiny->CR1 |= USART_CR1_UE;

  return true;
}


/******************************************************************************
 * Se the U(S)ARTs communication parameters
 * currently all comm parameters except baudrate are fixed!
 *****************************************************************************/
bool Usart_SetCommParams(const HW_DeviceType *self, uint32_t baudrate, bool bFirstInit )
{
  USART_AdditionalDataType *adt = USART_GetAdditionalData(self);
  UsartCommT comm;  

  /* stopbits, parity and wordlength are always taken from static configuration */
  comm.baudrate     = baudrate;
  comm.stopbits     = adt->myStopbits;
  comm.parity       = adt->myParity;
  comm.wordlength   = adt->myWordlength;

  return Usart_SetCommParamsLong(self, &comm, bFirstInit);
}
/******************************************************************************
 * Wrapper for "Usart_SetCommParams"
 * Thsi function will be called by device manager every time the system
 * frequency changes
 *****************************************************************************/
bool Usart_OnFrqChange( const HW_DeviceType *self )
{
    return Usart_SetCommParams(self, USART_GetAdditionalData(self)->myBaudrate, false );
}

/**
  * @brief DMA UART transmit process complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void UART_DMATransmitCplt(DMA_HandleTypeDef *hdma)
{
  UsartHandleT *uhandle = (UsartHandleT *)(hdma->Parent);
  
  /* DMA Normal mode */
  // debug_putchar('x');
  if ( DMA_IS_LINEAR(hdma) ) {  
    /* Disable the DMA transfer for transmit request by resetting the DMAT bit
    in the UART CR3 register */
    CLEAR_BIT(uhandle->Instance->CR3, USART_CR3_DMAT);
    
    /* Enable the UART Transmit Complete Interrupt */
    SET_BIT(uhandle->Instance->CR1, USART_CR1_TCIE);
  } else {
    /* DMA Circular mode, not implemented */
    Error_Handler_XX(-16, __FILE__, __LINE__);
  }
}

/**
  * @brief DMA UART receive process complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void UART_DMAReceiveCplt(DMA_HandleTypeDef *hdma)
{
  UsartHandleT *uhandle = (UsartHandleT *)(hdma->Parent);
  /* Get the number of bytes transferred (ideally the requested number of bytes ) */
  uhandle->RxCount = uhandle->RxSize - DMA_GET_RXSIZE(hdma);

  /* DMA Normal mode */
  if ( DMA_IS_LINEAR(hdma) )
  {
    
    /* Disable PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(uhandle->Instance->CR1, USART_CR1_PEIE);
    CLEAR_BIT(uhandle->Instance->CR3, USART_CR3_EIE);
    
    /* Disable the DMA transfer for the receiver request by resetting the DMAR bit
       in the UART CR3 register */
    CLEAR_BIT(uhandle->Instance->CR3, USART_CR3_DMAR);

    /* Disable Receiver */
    CLEAR_BIT(uhandle->Instance->CR1, USART_CR1_RE );    
  }
  
  if (uhandle->OnRx) uhandle->OnRx(uhandle, 0 );
}

/**
  * @brief DMA UART communication error callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void UART_DMAError(DMA_HandleTypeDef *hdma)
{
  UsartHandleT *uhandle = (UsartHandleT *)(hdma->Parent);
  
  /* Stop UART DMA Tx request if ongoing */
  if (HAL_IS_BIT_SET(uhandle->Instance->CR3, USART_CR3_DMAT) ) {
    UsartStopTx(uhandle);
  }
  
  /* Stop UART DMA Rx request if ongoing */
  if ( HAL_IS_BIT_SET(uhandle->Instance->CR3, USART_CR3_DMAR) ) {
    UsartStopRx(uhandle);
  }
  
