rainer20512/stm32-fw/common/src/dev/uart_dev.c
    #if defined(COM2_USE_TX_DMA)
        static DMA_HandleTypeDef hdma_com2_tx;
        static const HW_DmaType dmatx_com2 = { &hdma_com2_tx, COM2_TX_DMA };
    #endif
    #if defined(COM2_USE_RX_DMA)
        static DMA_HandleTypeDef hdma_com2_rx;
        static const HW_DmaType dmarx_com2 = { &hdma_com2_rx, COM2_RX_DMA };
    #endif

    static const HW_IrqList irq_com2 = {
        .num = 1,
        .irq = { COM2_IRQ, },
    };

    const HW_DeviceType HW_COM2 = {
        .devName        = "COM2",
        .devBase        = USART2,
        .devGpioAF        = &gpio_com2,
        .devGpioIO        = NULL,
        .devType        =  HW_DEVICE_UART,
        .devData        = &additional_com2,
        .devIrqList     = &irq_com2,
        #if defined(COM2_USE_TX_DMA)
            .devDmaTx = &dmatx_com2,
        #else
            .devDmaTx = NULL,
        #endif
        #if defined(COM2_USE_RX_DMA)
            .devDmaRx = &dmarx_com2,
        #else
            .devDmaRx = NULL,
        #endif

        .Init           = COM_Init,
        .DeInit         = COM_DeInit,
        .OnFrqChange    = Usart_OnFrqChange,
        .AllowStop      = COM_AllowStop,
        .OnSleep        = NULL,
        .OnWakeUp       = NULL,
    };
#endif


#if defined(USART3) && defined(USE_USART3)
    UsartHandleT HandleCOM3;

    static const HW_GpioList_AF gpio_com3 = {
        .num = 2,
        .gpio = {COM3_TX, COM3_RX} ,
    };

    static const USART_AdditionalDataType additional_com3 = {
        &HandleCOM3,
        DEBUG_BAUDRATE,
        UART_STOPBITS_1,
        UART_PARITY_NONE,
        UART_WORDLENGTH_8B,
    };

    #if defined(COM3_USE_TX_DMA)
        static DMA_HandleTypeDef hdma_com3_tx;
        static const HW_DmaType dmatx_com3 = { &hdma_com3_tx, COM3_TX_DMA };
    #endif
    #if defined(COM3_USE_RX_DMA)
        static DMA_HandleTypeDef hdma_com3_rx;
        static const HW_DmaType dmarx_com3 = { &hdma_com3_rx, COM3_RX_DMA };
    #endif

    static const HW_IrqList irq_com3 = {
        .num = 1,
        .irq = { COM3_IRQ, },
    };

    const HW_DeviceType HW_COM3 = {
        .devName        = "COM3",
        .devBase        = USART3,
        .devGpioAF        = &gpio_com3,
        .devGpioIO        = NULL,
        .devType        =  HW_DEVICE_UART,
        .devData        = &additional_com3,
        .devIrqList     = &irq_com3,
        #if defined(COM3_USE_TX_DMA)
            .devDmaTx = &dmatx_com3,
        #else
            .devDmaTx = NULL,
        #endif
        #if defined(COM3_USE_RX_DMA)
            .devDmaRx = &dmarx_com3,
        #else
            .devDmaRx = NULL,
        #endif

        .Init           = COM_Init,
        .DeInit         = COM_DeInit,
        .OnFrqChange    = Usart_OnFrqChange,
        .AllowStop      = COM_AllowStop,
        .OnSleep        = NULL,
        .OnWakeUp       = NULL,
    };
#endif


#if defined(UART4) && defined(USE_UART4)
    UsartHandleT HandleCOM4;

    static const HW_GpioList_AF gpio_com4 = {
        .num = 2,
        .gpio = {COM4_TX, COM4_RX} ,
    };

    static const USART_AdditionalDataType additional_com4 = {
        &HandleCOM4,
        DEBUG_BAUDRATE,
        UART_STOPBITS_1,
        UART_PARITY_NONE,
        UART_WORDLENGTH_8B,
    };

    #if defined(COM4_USE_TX_DMA)
        static DMA_HandleTypeDef hdma_com4_tx;
        static const HW_DmaType dmatx_com4 = { &hdma_com4_tx, COM4_TX_DMA };
    #endif
    #if defined(COM4_USE_RX_DMA)
        static DMA_HandleTypeDef hdma_com4_rx;
        static const HW_DmaType dmarx_com4 = { &hdma_com4_rx, COM4_RX_DMA };
    #endif

    static const HW_IrqList irq_com4 = {
        .num = 1,
        .irq = { COM4_IRQ, },
    };

    const HW_DeviceType HW_COM4 = {
        .devName        = "COM4",
        .devBase        = UART4,
        .devGpioAF        = &gpio_com4,
        .devGpioIO        = NULL,
        .devType        =  HW_DEVICE_UART,
        .devData        = &additional_com4,
        .devIrqList     = &irq_com4,
        #if defined(COM4_USE_TX_DMA)
            .devDmaTx = &dmatx_com4,
        #else
            .devDmaTx = NULL,
        #endif
        #if defined(COM4_USE_RX_DMA)
            .devDmaRx = &dmarx_com4,
        #else
            .devDmaRx = NULL,
        #endif

        .Init           = COM_Init,
        .DeInit         = COM_DeInit,
        .OnFrqChange    = Usart_OnFrqChange,
        .AllowStop      = COM_AllowStop,
        .OnSleep        = NULL,
        .OnWakeUp       = NULL,
    };
#endif


#if defined(UART5) && defined(USE_UART5)
    UsartHandleT HandleCOM5;

    static const HW_GpioList_AF gpio_com5 = {
        .num = 2,
        .gpio = {COM5_TX, COM5_RX} ,
    };

    static const USART_AdditionalDataType additional_com5 = {
        &HandleCOM5,
        DEBUG_BAUDRATE,
        UART_STOPBITS_1,
        UART_PARITY_NONE,
        UART_WORDLENGTH_8B,
    };

    #if defined(COM5_USE_TX_DMA)
        static DMA_HandleTypeDef hdma_com5_tx;
        static const HW_DmaType dmatx_com5 = { &hdma_com5_tx, COM5_TX_DMA };
    #endif
    #if defined(COM5_USE_RX_DMA)
        static DMA_HandleTypeDef hdma_com5_rx;
        static const HW_DmaType dmarx_com5 = { &hdma_com5_rx, COM5_RX_DMA };
    #endif

    static const HW_IrqList irq_com5 = {
        .num = 1,
        .irq = { COM5_IRQ, },
    };

    const HW_DeviceType HW_COM5 = {
        .devName        = "COM5",
        .devBase        = UART5,
        .devGpioAF      = &gpio_com5,
        .devGpioIO      = NULL,
        .devType        =  HW_DEVICE_UART,
        .devData        = &additional_com5,
        .devIrqList     = &irq_com5,
        #if defined(COM5_USE_TX_DMA)
            .devDmaTx = &dmatx_com5,
        #else
            .devDmaTx = NULL,
        #endif
        #if defined(COM5_USE_RX_DMA)
            .devDmaRx = &dmarx_com5,
        #else
            .devDmaRx = NULL,
        #endif

        .Init           = COM_Init,
        .DeInit         = COM_DeInit,
        .OnFrqChange    = Usart_OnFrqChange,
        .AllowStop      = COM_AllowStop,
        .OnSleep        = NULL,
        .OnWakeUp       = NULL,
    };
#endif

#if defined(USART6) && defined(USE_USART6)
    UsartHandleT HandleCOM6;

    static const HW_GpioList_AF gpio_com6 = {
        .num = 2,
        .gpio = {COM6_TX, COM6_RX} ,
    };

    #if defined(COM6_USE_TX_DMA)
        static DMA_HandleTypeDef hdma_com6_tx;
        static const HW_DmaType dmatx_com6 = { &hdma_com6_tx, COM6_TX_DMA };
    #endif
    #if defined(COM6_USE_RX_DMA)
        static DMA_HandleTypeDef hdma_com6_rx;
        static const HW_DmaType dmarx_com6 = { &hdma_com6_rx, COM6_RX_DMA };
    #endif

    static const USART_AdditionalDataType additional_com6 = {
        &HandleCOM6,
        DEBUG_BAUDRATE,
        UART_STOPBITS_1,
        UART_PARITY_NONE,
        UART_WORDLENGTH_8B,
    };

